
# -*- coding: utf-8 -*-
#这里的response仅为例子，将自己的识别结果替换到response中，即可将识别结果中的文字识别结果提取出来

response =   {"code": 0, "data": {"force_refresh": "0", "result": {"file_length": 292652, "lattice": [{"begin": "910", "end": "8330", "json_1best": {"st": {"bg": "910", "ed": "8330", "pa": "7554", "pt": "reserved", "rl": "0", "rt": [{"nb": "1", "nc": "1.0", "ws": [{"cw": [{"lg": "", "w": "蔡", "wc": "1.0000", "wp": "n"}], "wb": 1, "we": 36}, {"cw": [{"lg": "", "w": "英", "wc": "1.0000", "wp": "n"}], "wb": 37, "we": 56}, {"cw": [{"lg": "", "w": "元", "wc": "1.0000", "wp": "n"}], "wb": 57, "we": 116}, {"cw": [{"lg": "", "w": "杰", "wc": "1.0000", "wp": "n"}], "wb": 117, "we": 140}, {"cw": [{"lg": "", "w": "、", "wc": "0.0000", "wp": "p"}], "wb": 140, "we": 140}, {"cw": [{"lg": "", "w": "江西", "wc": "1.0000", "wp": "n"}], "wb": 141, "we": 200}, {"cw": [{"lg": "", "w": "南昌", "wc": "1.0000", "wp": "n"}], "wb": 201, "we": 256}, {"cw": [{"lg": "", "w": "县", "wc": "1.0000", "wp": "n"}], "wb": 257, "we": 292}, {"cw": [{"lg": "", "w": "以及", "wc": "0.7541", "wp": "n"}], "wb": 293, "we": 348}, {"cw": [{"lg": "", "w": "山东", "wc": "1.0000", "wp": "n"}], "wb": 349, "we": 396}, {"cw": [{"lg": "", "w": "虞城县", "wc": "0.5040", "wp": "n"}], "wb": 397, "we": 480}, {"cw": [{"lg": "", "w": "明朝", "wc": "1.0000", "wp": "n"}], "wb": 481, "we": 548}, {"cw": [{"lg": "", "w": "政治", "wc": "1.0000", "wp": "n"}], "wb": 549, "we": 592}, {"cw": [{"lg": "", "w": "人物", "wc": "1.0000", "wp": "n"}], "wb": 593, "we": 628}, {"cw": [{"lg": "", "w": "竟是", "wc": "0.2523", "wp": "n"}], "wb": 629, "we": 672}, {"cw": [{"lg": "", "w": "出身", "wc": "1.0000", "wp": "n"}], "wb": 673, "we": 736}, {"cw": [{"lg": "", "w": "。", "wc": "0.0000", "wp": "p"}], "wb": 736, "we": 736}, {"cw": [{"lg": "", "w": "", "wc": "0.0000", "wp": "g"}], "wb": 736, "we": 736}]}], "sc": "0.84", "si": "35222"}}, "lid": "7554", "spk": "段落-0"}], "lattice2": [{"begin": "910", "end": "8330", "json_1best": {"st": {"bg": "910", "ed": "8330", "pa": "7554", "pt": "reserved", "rl": "0", "rt": [{"nb": "1", "nc": "1.0", "ws": [{"cw": [{"lg": "", "w": "蔡", "wc": "1.0000", "wp": "n"}], "wb": 1, "we": 36}, {"cw": [{"lg": "", "w": "英", "wc": "1.0000", "wp": "n"}], "wb": 37, "we": 56}, {"cw": [{"lg": "", "w": "元", "wc": "1.0000", "wp": "n"}], "wb": 57, "we": 116}, {"cw": [{"lg": "", "w": "杰", "wc": "1.0000", "wp": "n"}], "wb": 117, "we": 140}, {"cw": [{"lg": "", "w": "、", "wc": "0.0000", "wp": "p"}], "wb": 140, "we": 140}, {"cw": [{"lg": "", "w": "江西", "wc": "1.0000", "wp": "n"}], "wb": 141, "we": 200}, {"cw": [{"lg": "", "w": "南昌", "wc": "1.0000", "wp": "n"}], "wb": 201, "we": 256}, {"cw": [{"lg": "", "w": "县", "wc": "1.0000", "wp": "n"}], "wb": 257, "we": 292}, {"cw": [{"lg": "", "w": "以及", "wc": "0.7541", "wp": "n"}], "wb": 293, "we": 348}, {"cw": [{"lg": "", "w": "山东", "wc": "1.0000", "wp": "n"}], "wb": 349, "we": 396}, {"cw": [{"lg": "", "w": "虞城县", "wc": "0.5040", "wp": "n"}], "wb": 397, "we": 480}, {"cw": [{"lg": "", "w": "明朝", "wc": "1.0000", "wp": "n"}], "wb": 481, "we": 548}, {"cw": [{"lg": "", "w": "政治", "wc": "1.0000", "wp": "n"}], "wb": 549, "we": 592}, {"cw": [{"lg": "", "w": "人物", "wc": "1.0000", "wp": "n"}], "wb": 593, "we": 628}, {"cw": [{"lg": "", "w": "竟是", "wc": "0.2523", "wp": "n"}], "wb": 629, "we": 672}, {"cw": [{"lg": "", "w": "出身", "wc": "1.0000", "wp": "n"}], "wb": 673, "we": 736}, {"cw": [{"lg": "", "w": "。", "wc": "0.0000", "wp": "p"}], "wb": 736, "we": 736}, {"cw": [{"lg": "", "w": "", "wc": "0.0000", "wp": "g"}], "wb": 736, "we": 736}]}], "sc": "0.84", "si": "35222"}}, "lid": "7554", "spk": "段落-0"}]}, "task_id": "240421130752566715595460", "task_status": "4", "task_type": "distribute_task"}, "message": "success", "sid": "ost000f2599@dx18eff0db8ca6f16902"}

rr = ""
resul_dict = response
data = resul_dict["data"]
result = data["result"]
lattice = result["lattice"]
for every_lattice in lattice:
    json_1best = every_lattice["json_1best"]
    st = json_1best["st"]
    rt = st["rt"]
    for every_rt in rt:
        ws = every_rt["ws"]
        for every_ws in ws:
            cw = every_ws["cw"]
            for every_cw in cw:
                rr = rr + every_cw["w"]
print(rr)
